#include<stdio.h>
int main() {
	//        类型只能是  整型和字符型        操作数（输入，输出的数  全用补码表示）并且正负号也一起计算   2进制补码
	//转换    补码转换为十进制  先判断是否为负数  正数：则直接变     负数：末位减去1  对其求反  再变（负数求补码颠倒）
	printf("%d\n",~0);//0补码为0000 0000   = -1
	printf("&=%d\n",5&7);//按位与0&0=0  1&0=0   0&1=0    1&1=1   
	printf("|=%d\n",-5|7);//按位或1|0=1  1|1=0  0|1=1   0|0=0
	printf("^=%d\n",5^7);//按位异或   相同=0  不同=1   1^0=1  0^0=1 1^1=0
	printf("~=%d\n",~5);//按位求反   ~1=0 ~0=1
	printf("<<=%d\n",5<<2);//左移  变成2进制数      左移指定的位数    左边溢出舍去     右边补0
	printf(">>=%d\n",5>>2);//右移  变成2进制数      右移指定的位数    右边溢出舍去     左边补0
	printf("<<=%d\n", -5 << 2);
	printf(">>=%d\n", -5 >> 2);
	printf("&=%d\n", 8 & 7);
	printf("&=%d\n", -5 & 6);
	printf("&=%d\n", -5 | 6);
	return 0;
}